The Merchant's Row is not
simply a store, it is a guild of artists and merchants providing unique and
high quality products to customers who appreciate creativity and
craft.

Located in Boston, Massachusettes, The Merchant's Row embraces the unique juxtaposition of
historical and modern influences endemic to Boston. The name is a reference to the actual Merchant's Row that existed in Boston during the colonial era. It also connotes the idea of a specialized, pre-department store shopping experience where personal interactions with owners and artists were
commonplace. Their inventory includes flowers, plants, artwork, baskets, pottery, furniture and garden supplies.

The Pomegranate Center
brings people together to build better
communities

POMEGRANATE CENTER
PROMOTIONAL GIFT
PACKAGE DESIGN 
BRANDING 
The Pomegranate Center is community oriented, with a focus on creativity, collaboration, joy,
flexibility and problem solving in a fast paced environment. They are
focused on increasing community interaction and through those interactions
bettering the community. The Pomegranate Center is focused on equipping the
community, however&nbsp;the community must also do the work. This
promotional gift is a reminder and a thank you to the sponsors of the
Pomegranate Center. The gift contains all of the tools needed to grow a
dwarf pomegranate tree, but the recipient must do the work for the seedling
to grow.


Acorn inspires users to go to National Trust sites by providing limited time discounts to
the sites and the areas around the sites. The suggested locations and
discounts are based on the user's interests and location. Users can invite
others to join them on their excursions and add the places they have been to
a checklist. While at the various National Trust sites users will be
provided with additional information about specific site locations.

I grew up in Malang, Indonesia, where a city of a
million people was considered small and moths were cranial sized. Eventually
I moved to Lynden, Washington, known for churches and raspberries, where I
attended middle school and high school. Currently, I just finished my very
last quarter at Western Washington University with a BFA in Design. Past
design projects have allowed me to explore solutions to dehydration for the
elderly, create slow motion studies of orange goop to optimize for best drip
consistency and interpret a viral podcast visually. Now&nbsp;I am looking to
continue my adventures in the bustling city of Seattle, Washington. When not
designing, I bake a mean raspberry pie in which the magic ingredient is
a few chassés while adding the basil.I also spend my
time dreaming about all of the hobbies I will acquire after
graduation and starting every other sentence with, “I was listening to
this podcast and…”


If you want to see an over abundance of cute animal pictures you can check out my
instagram.




The Bugs Box is created to be one in a line of educational subscription boxes for 7-10 year
olds. Each box focuses on a central theme;&nbsp;in this case, bugs. Included
in this box are explorations of three different kinds of bugs: insects,
software and microorganisms. The insect section teaches kids about the
different American state insects. Kids get to place a sticker on the map of
any state bugs they see. The microorganism section defines microorganisms
and gives kids instructions and the tools to harvest yeast from the air,
which is the first step in creating a sourdough bread starter. The software
section defines computer programmers, software&nbsp;and software bugs. The
software bug section contains a puzzle game that teaches kids basic computer
coding logic.




Anything goes in the bun!
Sassy, fun and not afraid of a little innuendo.

EXPERIENTIAL DESING 

BRANDING 

WEB DESIGN

Hot Mess is a
philly cheesesteak food truck located downtown Bellingham. They have a fun
and almost irreverant style and are willing to put almost anything on their
buns. The redesign focused on creating a food truck wrap as well as extra
collateral and a website that would allow users to easily find the food
truck day to day as it moves around town.



We focus on a learning
first independence driven solution for hydration in 60+ individuals. Using a
prompt, action, reward interaction cycle Hapi strives to keep people
healthy. 


HAPI
PRODUCT DESIGN      
UX
LOGO DESIGN   
As we age, our body
water content decreases, the risk of dehydration increases and the
consequences become more serious. Dehydration has been associated with
impaired cognition, acute confusion, falling and constipation.Your body
water decreases by 15% between the ages of 20-80. In addition, the elderly
experience diminished thirst sensation which leads to less fluid
consumption. Hapi’s goal is to educate people on the importance of hydration
and provide them with the tools to make hydrating a
habit.



INTERACTION CYCLE<

Hapi was envisioned during a workshop lead by Jason
Sack, lead UX designer of Weiden and Kennedy. The workshop emphasized the
concept of empathy in design, specifically UX design. The brief was to
create some sort of service or product to benefit the elderly demographic of
60+. After conducting research, my partner, Ben Young, and I decided to
focus on the issue of hydration. Our product focuses on creating an
ecosystem that includes education, a smart water bottle that tracks your
water intake, and a wearable that acts as a reminder to drink
water.



The smart waterbottle, Sip,
is designed with features specifically for the elderly demograhpic. The
bottom half of the bottle is made out of flexible sillicon that easily
collapses on itself for easy transport and compactness. The bottle comes in
3 parts for easy replacement and lid customization. The bottle features an
e-ink screen which is very low battery usage and the UI is so easy, you
can't mess it up. Sip also acts as the action part of the prompt, action,
reward interaction cycle.

DROPLET
The wearable, Droplet, acts as the prompt and
reward part of the interaction cycle. It vibrates to remind the user to
drink water and displays the daily water intake progress percentages. The
wearable is versatile, and can be worn as a bracelet, necklace, or just put
in a pocket.

MARKETING AND STRATEGY
Hapi is marketed towards the people who would be
purchasing the product, rather than necessarily the people who would be
using it. In this case, that would be caretakers, children of the elderly,
and nursing homes. For this demographic we focused on a website as the main
marketing tool. In order to familiarize the end user, the elderly, with the
brand we created a mailer brochure that focused on educating people about
the importance of hydration. 


Wingman Brewers needed
labels that complimented their existing WWII inspired
brand.
WINGMAN BREWERS LABLES
PACKAGE DESIGN      
BRAND
EXTENSION
Wingman Brewers in
Tacoma, Washington needed label designs to go with their new beers. Each
label is supposed to be unique, gaining its identity from the ingredients,
while also fitting in with the current label template and Wingman Brewers'
overall brand. The Wingman Brewers brand was initially inspired by WWII
airplane nose art and now embraces the vintage WWII aesthetic. The labels
incorporate military and airforce visual references. 



NICKELODEON TV
IDENTS<
ART DIRECTON      
VIDEO
PRODUCTION      
VIDEO EDITING          
Nickelodeon focuses on being fun and not afraid to get
a little messy. They recently rebranded themselves steering away from the
goo of the 90's to a hyper clean Cinema 4D looking aesthetic. I wanted to
merge the two to maintain the older demographic who missed the slime of the
90's while still appealing to the younger generation who wanted super clean
images. I started with the pristine white toys and then splashed them with
goo. (A very special recipe of flour, water and lots of food coloring.) I
was responsible for all aspects of this project from concept, to shooting,
to post production and editing. 





MAKE.SHIFT ART SPACE PROMO VIDEO


As a group of 10
students in the Western Washington University Design BFA program, we
produced a promotional video to highlight a local northwest non-profit
rentable art studio called Make.Shift. The goal of the video was to give
Make.Shift an inspiring and concise video that could speak to artists,
community members, and current or potential donors. With the mentorship of a
local filmmaker, we broke into teams to tackle scripting, storyboarding, on-
site scouting, and scheduling. We focused on highlighting the eclectic
nature of the nonprofit and the incredible tenants acting as the lifeblood
of the organization. As an art director on the project I was responsible for
making sure the overall concept came through in all aspects of the promo. In
addition, I was responsible for collecting any props that were needed and
for finding and creating the 3D letters to spell Make
Shift.




Serial 12 is an exploratory
translation of the underlying themes and concepts presented in the podcast
Serial. 

PACKAGING      
BRANDING


The  goal of Serial 12
was to create a translation of Serial the podcast, rather than a replication
of the resources that already exist online. The primary audience of Serial
12 consists of the die-hard fans. The people who have alread listened to
Serial and want to re-listen to gain new insight. They have already looked
up all of the diagrams on Serial's website, scoured the subreddit page and
read all of the surrounding articles. A literal reinterpretation of all that
content would be redundant. So, instead, Serial 12 is an exploratory
translation of the underlying themes and concepts presented in Serial and
the consequent social ramifications of the podcast. In an effort to be
sensitive to the real life nature of the podcast, the translation steers
away from any sort of game or entertainment mentality, but rather is an
exploration of human interaction, expectation, and
perception.

Serial's original colors and aesthetics are
reminiscent of 50's film noir style with an emphasis on shadow, vignettes
and a contrast of black and white. For Serial 12 the colors are similar but
not as starkly contrasted. Stylistically the colors and aesthetics are also
based on the looks of photography from the 90's: low resolution, graininess
and low contrast. To keep in line with Serial's current branding and to
establish an aesthetic connection between the podcast and the product,
Sackers Gothic Heavy, one of Serial's current brand fonts was chosen. The
supporting font is Courier Regular chosen for its impersonal mono-spaced,
antiquated and legal-form like qualities. 




VISUALIZING THE ABSTRACT


Aesthetically, Serial 12 is based loosely on the original
Serial branding. However, the visual motifs are largely unassociated with
the original podcast branding. Much of the typography is inspired by
newspaper paper layouts. During the time of the case newspaper were more of
a widespread way of gathering daily information and were much more relevant.
Newspapers boast of justified columns, tight margins and condensed text.
These aesthetics are all incorporated into Serial 12. Listeners of Serial
are one step removed from the actual case and what happened. Except for a
few listeners who decided to find the participants, listeners stay one step
removed from the case. Large margins in many of the pieces emphasize the
voyeuristic quality of listening to a podcast. They are never directly
involved with the story and they can only look in on the details as an
outsider. The margins act as a barrier between the listener and the story.
When listening to Serial only bits and pieces of the information are
revealed. Information is disjointed and incomplete at best. The entirety of
the podcast is based on holes in people's stories and holes in people's
recollections. The Serial 12 logo mark and other pieces bear this mark of
fragmentation.  



The box
was designed as a space to place easter eggs to delight long time listeners
of the podcast. On the inside there is a visualization of the iconic
MailChimp (kimp) clip. The MailChimp clip is separated out by line breaks
into the 7 voices and background conversation that occurs in the
clip

THE BOX

THE PAMPHLET

The
pamphlet serves as a guide book to the Serial 12 experience. On the cover it
includes a transcript of the intro of the podcast. Inside it describes the
purpose of the concept in general as well as gives details about the three
pieces contained within the box. On the back is a graph drawn by Adnan Syed
for Sarah Koenig demonstraiting how easy it is to misrepresent information.



THE PAMPHLET

Perception and conflicting perceptions are main themes in
Serial. This book juxtaposes quotes of first hand witnesses and their
opinion of Adnan Syed, punctuated with newspaper clippings from during the
time of the case. The book ends with a poignant quote from Adnan about
people's perceptions  


THE Book
Generally, listening is a passive role. However, during
Serial the listener is constantly trying to make sense of the story, taking
on a more active role. The box puzzle is interactive to reflect the nature
of the listener. Throughout Serial, the listener thinks that by the end they
will have pieced together what happened in the case, but by the end of the
12 episodes, there is no conclusion. Likewise, the shadow box and it's five
frames, seem to be coming together to form a complete image, but the
fragmented image never becomes whole.  




THE Puzzle



The third is about an abundance of details that are
so nitty gritty they become overwhelming. The word search contains the route
that Adnan would have taken from school to the Best Buy parking lot. In
addition to the route, the poster contains an optical illusion of the number
21. The number of minutes that Adnan's whereabouts are in question. Finding
the words requires close inspection, where as seeing the 21 requires a step
back. The action mimics the action required to sort through immense amounts
of detailed information. Viewing data on a micro and macro level to get the
best understanding. 

